1. ما هي الـWorld Coordinates؟

هي الإحداثيات المشتركة لكل المشهد.


World
┌──────────────────────────┐
│ A B A B A B              │
│ B A B A B A              │
│                          │
│       Sphere             │
└──────────────────────────┘
فالـCheckerboard سيتحرك مع مكان الـSphere في العالم.

أي أن Pattern مربوط بالمشهد نفسه:

World
┌──────────────────────────┐
│ A B A B A B              │
│ B A B A B A              │
│                          │
│       Sphere             │
└──────────────────────────┘

إذا حركنا Sphere، فإنها ستأخذ أجزاء مختلفة من الـPattern العالمي.

وهذا ليس بالضرورة السلوك الذي نريده من Object Pattern.



